# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
City..::..Name Property
City Class See Also
---
The name of the city
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
}
```

# Remarks
A read only string property that contains the name of the city, such as Boston.
# See Also
City Class
Autodesk.Revit.DB Namespace